import pandas as pd

df = pd.read_csv('World-happiness-report-2024.csv')
print(df.head(3), df.tail(4))  # Функция .head - вывод первых 5 строк по-умолчанию.
# Можно указать любое кол-во строк.
# Функция .tail - Вывод последних строк
print("\n----------------------------------------------------------------\n")
print(df.info())  # Вывод сведений о массиве
print("\n----------------------------------------------------------------\n")
print(df.describe())  # Статистическое описание данных
print("\n----------------------------------------------------------------\n")
print(df[['Country name', 'Regional indicator']])  # Вывод конкретных столбцов. Если >1 - двойные []
print("\n----------------------------------------------------------------\n")
print(df.loc[56])  # Вывод всей информации по строке 56
print("\n----------------------------------------------------------------\n")
print(df.loc[56, 'Social support'])  # Вывод конкретного параметра в строке 56
print("\n----------------------------------------------------------------\n")
print(df.loc[df['Healthy life expectancy'] > .7, ['Country name', 'Healthy life expectancy']])
# Фильтрация в столбце по конкретному условию и выбор кол-ва столбцов для более, чем одномерного массива

df = pd.read_csv('World-happiness-report-2024.csv')
